Revit 2026 API

# ScheduleFilterGetIntegerValue Method

---

Gets the filter value for a filter using an integer value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetIntegerValue()
```
```vb
Public Function GetIntegerValue As Integer
```
```cpp
public:
int GetIntegerValue()
```
```fsharp
member GetIntegerValue : unit -> int
```

#### Return Value

Int32 The filter value.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The filter value is not an integer. |

#### Reference

ScheduleFilter Class

Autodesk.Revit.DB Namespace